; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared2 - mode
	infrared0 - mode
	infrared3 - mode
	thermograph1 - mode
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 infrared2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared2)
	(supports instrument8 infrared0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite3 Star10)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 infrared0)
	(have_image Planet7 infrared3)
	(have_image Phenomenon8 infrared2)
	(have_image Star9 thermograph1)
	(have_image Star10 infrared0)
))

)

; plan
1. (turn_to satellite3 groundstation0 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 8
3. (calibrate satellite3 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 8
4. (turn_to satellite3 planet6 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet6)
   goals met: 0 of 8
5. (take_image satellite3 planet6 instrument8 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon8)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 8
8. (take_image satellite3 phenomenon8 instrument8 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (turn_to satellite0 planet7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet7)
   goals met: 2 of 8
12. (take_image satellite0 planet7 instrument0 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 3 of 8
13. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 3 of 8
14. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 4 of 8
15. (turn_to satellite0 phenomenon5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon5)
   goals met: 5 of 8
16. (take_image satellite0 phenomenon5 instrument0 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 6 of 8
17. (turn_to satellite3 star10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star10)
   goals met: 7 of 8
18. (take_image satellite3 star10 instrument8 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 8
